Fix graph data model diagram
